package MagicJava;

public class Lesson036 {

    // @Ignore - для игнорирования тестового метода
    // Assume - тест игнорируется не выдает failed как в Assert

    //@BeforeClass запускается один раз для тестового класса (он static)
    //далее создается экземпляр(объект) тестового класса
    //@Before обе аннотации для внесения данных, подготовки - он запускается перед каждым тестовым методом

    //@Test

    //After (запускается для каждого тестового метода)
    //AfterClass ждя завершающих процедур, например закрытия соединений и пр. (тоже static)
}
